#!/usr/bin/env python3

# https://leetcode-cn.com/problems/gray-code
# 格雷编码是一个二进制数字系统，在该系统中，两个连续的数值仅有一个位数的差异。
# 给定一个代表编码总位数的非负整数 n，打印其格雷编码序列。格雷编码序列必须以 0 开头。
#
# 示例 1:
# 输入: 2
# 输出: [0,1,3,2]
# 解释:
# 00 - 0
# 01 - 1
# 11 - 3
# 10 - 2
# 对于给定的 n，其格雷编码序列并不唯一。
# 例如，[0,2,3,1] 也是一个有效的格雷编码序列。
# 00 - 0
# 10 - 2
# 11 - 3
# 01 - 1
#
# 示例 2:
# 输入: 0
# 输出: [0]
# 解释: 我们定义格雷编码序列必须以 0 开头。
#      给定编码总位数为 n 的格雷编码序列，其长度为 2^n。当 n = 0 时，长度为 2^0 = 1。
#      因此，当 n = 0 时，其格雷编码序列为 [0]。


class Solution:
    def grayCode(self, n: int) -> [int]:
        res = [0]
        for i in range(n):
            s = 2 ** i
            for idx in range(len(res) - 1, -1, -1):
                res.append(res[idx] + s)
        return res


print(Solution().grayCode(2))  # [0,1,3,2]
print(Solution().grayCode(0))  # [0]
print(Solution().grayCode(3))

# 0 [0]
# 1 [0, 1]            0    1
# 2 [0, 1, 3, 2]      00   01 11 10
# 3 [0, 1, 3,]        000  001 011 010   (100 101 111 110)倒序
#                    000 001 011 010 110 111 101 100
# 4                0000 00001 0011 0010 0110 0111 0101 0100   (1000 1001 1011 1010 1110 1111 1101 1100)倒序
